// 보그코리아 회원가입 페이지 JS - member.js //

$(function(){ /////// jQB ////////////////////////////

    /// 서브밋 버튼 클릭시 아이디,비번 입력확인하기 ///
    /// 이벤트대상: #sbtn
    /// 체크대상: #mid, #mpw

    // 아이디요소
    let mid = $("#mid");
    // 비번요소
    let mpw = $("#mpw");


    $("#sbtn").click(function(e){

        // 기본기능막기: 서브밋 기능막기!
        e.preventDefault();


        // 두값이 모두 빈 값인지 체크함
        // val() 은 선택요소의 값을 읽거나 쓰는 메서드
        if(mid.val() === "" || mpw.val() === ""){
            alert("아이디와 비밀번호 모두 입력해야합니다!");
        } ///////// if //////////





    }); //////////// click ///////////////////





}); /////////////////////// jQB //////////////////////
