// GNB 링크 이동 셋팅하기 - linksys.js //

// 원페이지 이므로 GNB메뉴는 한 페이지안에서
// 페이지의 위치 이동을 애니메이션 한다!
// 동시에 페이지 위치표시자를 사용하여
// 페이지의 현재위치를 표시해 준다!
// 현재 페이지에 해당하는 GNB는 클래스를 
// 사용하여 마우스오버시와 동일한 디자인을 준다!

$(function(){ //////// jQB ////////////////////////////

    // 대상: .gnb a 
    
    $(".gnb a").click(function(e){

        // 1. 기본이동막기
        e.preventDefault();

        // 2. 클릭된 a의 부모 li의 순번 알아내기
        // index() 메서드사용! -> 선택요소의 순번을 리턴!
        // parent() 메서드는 a요소의 부모인 li로 올라간다!
        // li는 순번이 0부터 읽어옴!
        let idx = $(this).parent().index();
    
        console.log("메뉴클릭!"+idx);
    
    }); //////////// click ///////////////////
    //////////////////////////////////////////


}); ///////////////// jQB ////////////////////////////
///////////////////////////////////////////////////////