// JavaScript Document

		
	$(function(){//////////////jQB////////////////////
		
	$(".sub").hide();//모든 서브메뉴 숨기기
	$(".sub").first().show();//첫번째 서브메뉴 보이기
	
	//////// .title을 클릭하면 다음 요소인 .sub가 슬라이드 애니메이션된다.
	$(".title").click(function(){
		if($(this).next().css("display") === "none")//이미 열려있으면 못들어옴
		{
			$(".sub:visible").slideUp(400);//현재 열려서 보이는 서브메뉴 닫기
			$(this).next().slideDown(400);//선택된 sub메뉴 열기
		}
		else{//서브메뉴가 보이는 경우 닫기
			$(this).next().slideUp(400);
		}
	});//click
	
		
		
		
	});//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////jQb/////////////////////////////